# üéØ Objective of This Project
#### To analyze e-commerce sales performance, customer behavior, product performance, and seller effectiveness using SQL, Python, and Power BI.

## Basic Info about Data
# 1Ô∏è‚É£ customers

Description:
Contains information about customers who placed orders.

Columns:
1. customer_id ‚Äì Unique ID for each customer (Primary Key)
2. customer_unique_id ‚Äì Unique identifier representing the real person
3. customer_city ‚Äì Customer‚Äôs city
4. customer_state ‚Äì Customer‚Äôs state

Purpose in Project:
Used for:
- State-wise revenue analysis
- Customer segmentation
- Repeat customer analysis

# 2Ô∏è‚É£ orders

Description:
Contains order-level information.

Columns:
1. order_id ‚Äì Unique order ID (Primary Key)
2. customer_id ‚Äì Links to customers table (Foreign Key)
3. order_status ‚Äì Status of order (delivered, canceled, etc.)
4. order_purchase_timestamp ‚Äì Date and time of purchase
5. order_approved_at ‚Äì When payment was approved
6. order_delivered_customer_date ‚Äì Delivery date
7. order_estimated_delivery_date ‚Äì Estimated delivery date

Purpose in Project:
Used for:
- Monthly revenue trends
- Delivery time analysis
- Order status analysis

# 3Ô∏è‚É£ order_items

Description:
Contains product-level details within each order.

Columns:
1. order_id ‚Äì Links to orders
2. order_item_id ‚Äì Item number within order
3. product_id ‚Äì Links to products
4. seller_id ‚Äì Links to sellers
5. shipping_limit_date ‚Äì Shipping deadline
6. price ‚Äì Product price
7. freight_value ‚Äì Shipping cost

Purpose in Project:
Used for:
- Revenue calculation
- Seller performance
- Product performance

# 4Ô∏è‚É£ products

Description:
Contains product-level details.

Columns:
1. product_id ‚Äì Unique product ID
2. product_category_name ‚Äì Category name
3. product_name_lenght
4. product_description_lenght
5. product_photos_qty
6. product_weight_g
7. product_length_cm
8. product_height_cm
9. product_width_cm

Purpose in Project:
Used for:
1. Category performance analysis
2. Product-level analytics

# 5Ô∏è‚É£ sellers

Description:
Contains seller information.

Columns:
1. seller_id ‚Äì Unique seller ID
2. seller_zip_code_prefix
3. seller_city
4. seller_state

Purpose in Project:
Used for:
- Seller performance analysis
- State-level sales analysis

# 6Ô∏è‚É£ order_payments

Description:
Contains payment details for each order.

Columns:
1. order_id ‚Äì Links to orders
2. payment_sequential ‚Äì Payment number
3. payment_type ‚Äì Payment method (credit card, boleto, etc.)
4. payment_installments ‚Äì Installment count
5. payment_value ‚Äì Amount paid

Purpose in Project:
Used for:
- Payment method analysis
- Revenue validation

# 7Ô∏è‚É£ category_translation

Description:
Translates Portuguese product categories into English.

Columns:
1. product_category_name
2. product_category_name_english

Purpose in Project:
Used for:
- Clean reporting
- English category dashboards

### SQL Connection

In [ ]:
import pandas as pd
from sqlalchemy import create_engine

username = "postgres"
password = ""
host = "localhost"
port = "5432"
database = "ecommerce_analysis"

engine = create_engine(f"postgresql://{username}:{password}@{host}:{port}/{database}")

print("Connection Successful!")

Connection Successful!

## PHASE 1 ‚Äî Business Understanding + Initial Exploration

### 1) Total Number of Customers

In [3]:
query = "SELECT COUNT(DISTINCT customer_unique_id) AS TOTAL_CUSTOMERS FROM CUSTOMERS;"
tc = pd.read_sql(query,engine)
tc

   total_customers
0            96096

### 2) Total Number of Orders

In [6]:
query = "SELECT COUNT(*) AS TOTAL_ORDERS FROM ORDERS"
os = pd.read_sql(query,engine)
os

   total_orders
0         99441

### 3) Total Number of Products

In [8]:
query = "SELECT COUNT(*) AS TOTAL_PRODUCTS FROM PRODUCTS;"
tp = pd.read_sql(query,engine)
tp

   total_products
0           32951

### 4) Total Number of Products Categories

In [10]:
query = "SELECT COUNT(DISTINCT product_category_name) AS TOTAL_CATEGORIES FROM PRODUCTS;"
tp = pd.read_sql(query,engine)
tp

   total_categories
0                73

### 5) Total Number of Sellers

In [11]:
query = "SELECT COUNT(DISTINCT seller_id) AS TOTAL_SELLERS FROM SELLERS;"
ts = pd.read_sql(query,engine)
ts

   total_sellers
0           3095

## Revenue Calculation

### 6) Total Revenue

In [12]:
query = "SELECT SUM(price+freight_value) AS TOTAL_REVENUE FROM ORDER_ITEMS;"
tr = pd.read_sql(query,engine)
tr

   total_revenue
0    15843553.24

### 7) Average Order Value

In [15]:
query = "SELECT AVG(TOTAL_REVENUE) AS AVG_ORDER_VALUE FROM (SELECT ORDER_ID,SUM(price+freight_value) as TOTAL_REVENUE FROM ORDER_ITEMS GROUP BY ORDER_ID);"
avg_rev = pd.read_sql(query,engine)
avg_rev

   avg_order_value
0       160.577638

### 8) Maximum Order Value

In [17]:
query = "SELECT MAX(TOTAL_REVENUE) AS MAX_ORDER_VALUE FROM (SELECT ORDER_ID,SUM(price+freight_value) AS TOTAL_REVENUE FROM ORDER_ITEMS GROUP BY ORDER_ID);"
max_rev = pd.read_sql(query, engine)
max_rev

   max_order_value
0         13664.08

### 9) Minimum Order Value

In [18]:
query = "SELECT MIN(TOTAL_REVENUE) AS MIN_ORDER_VALUE FROM (SELECT ORDER_ID,SUM(price+freight_value) AS TOTAL_REVENUE FROM ORDER_ITEMS GROUP BY ORDER_ID);"
min_rev = pd.read_sql(query, engine)
min_rev

   min_order_value
0             9.59

## ORDERS ANALYSIS

### 10) Order Status Analysis

In [25]:
query = "SELECT ORDER_STATUS,COUNT(*) FROM ORDERS GROUP BY ORDER_STATUS ORDER BY COUNT DESC;"
order_status = pd.read_sql(query,engine)
order_status

  order_status  count
0    delivered  96478
1      shipped   1107
2     canceled    625
3  unavailable    609
4     invoiced    314
5   processing    301
6      created      5
7     approved      2

### 11) Percentage of 'Delivered' Orders

In [29]:
query = "SELECT (COUNT(*) FILTER (WHERE ORDER_STATUS = 'delivered') * 100) / COUNT(*) AS DELIVER_SHARE_PERCENT FROM ORDERS;"
delivered = pd.read_sql(query,engine)
delivered

   deliver_share_percent
0                     97

## Date Analysis

### 12) First Date of Orders

In [31]:
query = "SELECT MIN(order_purchase_timestamp) AS FIRST_ORDER_DATE FROM ORDERS;"
min_date = pd.read_sql(query,engine)
min_date

     first_order_date
0 2016-09-04 21:15:19

### 13) First Date of Orders

In [33]:
query = "SELECT MAX(order_purchase_timestamp) AS LAST_ORDER_DATE FROM ORDERS;"
min_date = pd.read_sql(query,engine)
min_date

      last_order_date
0 2018-10-17 17:30:18